src/Documents/ПриходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПриходныйКассовыйОрдер</Name>
			<BasedOn>
				<xr:Item>Document.Реализация</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступленияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ВидыОперацийПоступленияДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступленияДенег</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПриходныйКассовыйОрдер/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Параметры:
//	видОперации - ПеречислениеСсылка.ВидыОперацийПоступленияДенег
//  значенияПолей - Структура, ФиксированнаяСтруктура
//      * Касса - СправочникСсылка.Кассы
//      * Плательщик - СправочникСсылка.Контрагенты, СправочникСсылка.Сотрудники
//      * Сумма - Число
// Возвращаемое значение:
//	- Структура
//      * СчетКредита - ПланСчетовСсылка.Хозрасчетный - [`РасчетыСПокупателями`, `РасчетыСПоставщиками`, `РасчетыСПодотчетнымиЛицами`]
//      * СубконтоДебет - СправочникСсылка.Кассы
//      * СубконтоКредит - СправочникСсылка.Контрагенты, СправочникСсылка.Сотрудники
//      * СодержаниеОперации - Строка
//      * Сумма - Число
Функция ПолучитьАналитикуПроводки(Знач видОперации, Знач значенияПолей) Экспорт
    структураАналитики = Новый Структура;
    структураАналитики.Вставить("СчетКредита", Неопределено);
    структураАналитики.Вставить("СубконтоДебет", значенияПолей.Касса);
    структураАналитики.Вставить("СубконтоКредит", Неопределено);
    структураАналитики.Вставить("СодержаниеОперации", Неопределено);
    структураАналитики.Вставить("Сумма", значенияПолей.Сумма);

    Если видОперации = Перечисления.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя Тогда
        структураАналитики.СчетКредита = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
        структураАналитики.СубконтоКредит = значенияПолей.Плательщик;
        структураАналитики.СодержаниеОперации = "Оплата от покупателя наличными в кассу";

    ИначеЕсли видОперации = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПоставщика Тогда
        структураАналитики.СчетКредита = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
        структураАналитики.СубконтоКредит = значенияПолей.Плательщик;
        структураАналитики.СодержаниеОперации = "Возврат от поставщика наличными в кассу";

    ИначеЕсли видОперации = Перечисления.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника Тогда
        структураАналитики.СчетКредита = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами;
        структураАналитики.СодержаниеОперации = "Возврат подотчетных средств";
        структураАналитики.СубконтоКредит = значенияПолей.Плательщик;

    Иначе
        ДиагностикаКлиентСервер.Утверждение(Ложь,
            СтрШаблон("Недопустимый вид операции: ""%1"".", Строка(видОперации)));
    КонецЕсли;

    Возврат структураАналитики;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
